In [22]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
from pandas import Series, DataFrame

In [23]:
df = pd.read_csv('000020-1.csv',index_col=0)

In [24]:
df.head()

            Close   Open   High    Low  Volume  Code  Up&Down      Rate
Date
2005-04-27  11250  10750  11500  10650   31610    20        0  0.000000
2005-04-28  11050  11200  11450  10950   12670    20     -200 -1.777778
2005-04-29  10900  10550  10950  10550   15280    20     -150 -1.357466
2005-05-02  11200  10900  11300  10750   71860    20      300  2.752294
2005-05-03  11700  11450  12150  11400  150848    20      500  4.464286

In [46]:
df.columns

Index(['Close', 'Open', 'High', 'Low', 'Volume', 'Code', 'Up&Down', 'Rate'], dtype='object')

In [28]:
df.head(0)

Empty DataFrame
Columns: [Close, Open, High, Low, Volume, Code, Up&Down, Rate]
Index: []

In [27]:
df['Close'].head(2)

Date
2005-04-27    11250
2005-04-28    11050
Name: Close, dtype: int64

In [30]:
df['Open'].count()

3025

In [34]:
only_up = df.where(df['Up&Down'] >0)

In [37]:
only_up['Close'].count()

1383

In [39]:
only_up.head()

,Close,Open,High,Low,Volume,Code,Up&Down,Rate
Date,,,,,,,,
2005-04-27,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2005-04-28,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2005-04-29,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2005-05-02,11200.0,10900.0,11300.0,10750.0,71860.0,20.0,300.0,2.752294
2005-05-03,11700.0,11450.0,12150.0,11400.0,150848.0,20.0,500.0,4.464286

In [42]:
only_up.dropna().head()

,Close,Open,High,Low,Volume,Code,Up&Down,Rate
Date,,,,,,,,
2005-05-02,11200.0,10900.0,11300.0,10750.0,71860.0,20.0,300.0,2.752294
2005-05-03,11700.0,11450.0,12150.0,11400.0,150848.0,20.0,500.0,4.464286
2005-05-04,13450.0,13450.0,13450.0,13450.0,425714.0,20.0,1750.0,14.957265
2005-05-06,13850.0,15000.0,15400.0,13600.0,984975.0,20.0,400.0,2.973978
2005-05-09,14400.0,14200.0,14550.0,13600.0,444290.0,20.0,550.0,3.971119

In [45]:
df.loc['2005-05-02']

Close      11200.000000
Open       10900.000000
High       11300.000000
Low        10750.000000
Volume     71860.000000
Code          20.000000
Up&Down      300.000000
Rate           2.752294
Name: 2005-05-02, dtype: float64

In [47]:
df.describe()

,Close,Open,High,Low,Volume,Code,Up&Down,Rate
count,3025.000000,3025.000000,3025.000000,3025.000000,3.025000e+03,3025.0,3025.000000,3025.000000
mean,17195.021488,16950.712397,17323.710744,16586.414876,1.197873e+05,20.0,-0.942149,0.052135
std,18341.319384,18226.411341,18679.677975,17747.869906,1.862912e+05,0.0,1094.898587,2.997461
min,4070.000000,0.000000,0.000000,0.000000,0.000000e+00,20.0,-40010.000000,-80.828283
25%,5600.000000,5570.000000,5670.000000,5500.000000,3.737000e+04,20.0,-100.000000,-1.188119
50%,7920.000000,7880.000000,8000.000000,7770.000000,6.732000e+04,20.0,0.000000,0.000000
75%,25200.000000,24400.000000,25300.000000,23700.000000,1.274530e+05,20.0,105.000000,1.224944
max,93000.000000,99700.000000,100000.000000,87000.000000,2.844188e+06,20.0,9200.000000,14.987715